#include<stdio.h>
#include<string.h>
int main()
{
    char s[1000001];
    fgets(s,1000001,stdin);
    for(int i=0;s[i]!='\\';i++)

   /// s[i] != '\\' → এই শর্ত মানে হলো:
///যতক্ষণ পর্যন্ত s[i] (অর্থাৎ স্ট্রিংয়ের বর্তমান অক্ষর) '\' না হয়, লুপ চালিয়ে যাও।
///এখানে '\\' মানে হলো একটা ব্যাকস্ল্যাশ (\) চিহ্ন।
///(C-তে ব্যাকস্ল্যাশ স্পেশাল ক্যারেক্টার, তাই লিখতে হয় '\\' হিসেবে।)

    ///for(int i=0; i!='\\'; i++)
///তাহলে পুরোপুরি ভুল হয়ে যেত, কারণ এখন লুপের শর্তে i আর স্ট্রিংয়ের কোনো অক্ষর নয় — এটা একটা ইন্টিজার ভ্যারিয়েবল, যার মান প্রথমে 0, তারপর 1, 2, 3… বাড়তে থাকে।

    {
        printf("%c",s[i]);
    }

    return 0;
}
